Revit 2026 API

# Curve Class

---

A parametric curve.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBGeometryObject Autodesk.Revit.DBCurve More

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class Curve : GeometryObject
```
```vb
Public Class Curve
	Inherits GeometryObject
```
```cpp
public ref class Curve : public GeometryObject
```
```fsharp
type Curve =
    class
        inherit GeometryObject
    end
```

The Curve type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ApproximateLength | The approximate length of the curve. |
|  | GraphicsStyleId | The ElementId of the GeometryObject's GraphicsStyle(Inherited from GeometryObject) |
|  | Id | A unique integer identifying the GeometryObject in its associated non view-specific GeometryElement.(Inherited from GeometryObject) |
|  | IsBound | Describes whether the parameter of the curve is restricted to a particular interval. |
|  | IsClosed | Describes whether the curve is closed. |
|  | IsCyclic | The boolean value that indicates whether this curve is cyclic. |
|  | IsElementGeometry | Indicates whether this geometry is obtained directly from an Element.(Inherited from GeometryObject) |
|  | IsReadOnly | Identifies if the object is read-only or modifiable.(Inherited from APIObject) |
|  | Length | The exact length of the curve. |
|  | Period | The period of this curve. |
|  | Reference | Returns a stable reference to the curve. |
|  | Visibility | The visibility.(Inherited from GeometryObject) |

|  | Name | Description |
| --- | --- | --- |
|  | Clone | Returns a copy of this curve. |
|  | ComputeClosestPoints |  |
|  | ComputeDerivatives | Returns the vectors describing the curve at the specified parameter. |
|  | ComputeNormalizedParameter | Computes the normalized curve parameter from the raw parameter. |
|  | ComputeRawParameter | Computes the raw parameter from the normalized parameter. |
|  | CreateOffset | Creates a new curve that is an offset of the existing curve. |
|  | CreateReversed | Creates a new curve with the opposite orientation of the existing curve. |
|  | CreateTransformed | Crates a new instance of a curve as a transformation of this curve. |
|  | Dispose | Causes the object to release immediately any resources it may be utilizing.(Inherited from APIObject) |
|  | Distance | Returns the shortest distance from the specified point to this curve. |
|  | Equals | Determines whether the specified Object is equal to the current Object. (Inherited from GeometryObject) |
|  | Evaluate | Evaluates and returns the point that matches a parameter along the curve. |
|  | GetEndParameter | Returns the raw parameter value at the start or end of this curve. |
|  | GetEndPoint | Returns the 3D point at the start or end of this curve. |
|  | GetEndPointReference | Returns a stable reference to the start point or the end point of the curve. |
|  | GetHashCode | Gets the integer value of the geometry object as hash code (Inherited from GeometryObject) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | Intersect(Curve) | **Obsolete.** Calculates the intersection of this curve with the specified curve. |
|  | Intersect(Curve, CurveIntersectResultOption) | Calculates the intersection of this curve with the specified curve. |
|  | Intersect(Curve, IntersectionResultArray) | **Obsolete.** Calculates the intersection of this curve with the specified curve and returns the intersection results. |
|  | IsInside(Double) | Indicates whether the specified parameter value is within this curve's bounds. |
|  | IsInside(Double, Int32) | Indicates whether the specified parameter value is within this curve's bounds and outputs the end index. |
|  | MakeBound | Changes the bounds of this curve to the specified values. |
|  | MakeUnbound | Makes this curve unbound. |
|  | Project | Projects the specified point on this curve. |
|  | SetGraphicsStyleId | Sets the graphics style id for this curve. |
|  | Tessellate | Valid only if the curve is bound. Returns a polyline approximation to the curve. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

The concrete curves are defined by parametric equations. If the curve is bound, it is only defined for an interval in parameterization. Otherwise, it is defined for all values of the parameter.

#### Reference

Autodesk.Revit.DB Namespace

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBGeometryObject Autodesk.Revit.DBCurve Autodesk.Revit.DBArc Autodesk.Revit.DBCylindricalHelix Autodesk.Revit.DBEllipse Autodesk.Revit.DBHermiteSpline Autodesk.Revit.DBLine Autodesk.Revit.DBNurbSpline